app/views/answers/mark_as_best.js.erb

$('.answers').html('<%= j render @question.answers.order(best: :desc) %>');
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."best" DESC  [["question_id", 6]]