app/controllers/answers_controller.rb

INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hgkjh"], ["question_id", 2], ["created_at", "2023-04-22 12:54:50.975335"], ["updated_at", "2023-04-22 12:54:50.975335"], ["user_id", 1]]
---
  def create
    @answer = @question.answers.create(answer_params.merge(user: current_user))

UPDATE "answers" SET "body" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["body", ",Jan,mjn"], ["updated_at", "2022-11-06 09:18:26.851870"], ["id", 5]]
---
  def update
    @answer.update(answer_params.merge(user: current_user))

DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 11]]
---
  def destroy
    @answer.destroy if current_user.author?(@answer)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_question
    @question = Question.find(params[:question_id])

SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def find_answer
    @answer = Answer.find(params[:id])