app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions"

  def create
    question.update(question_params)
    @question.user = current_user

    if @question.save
---
INSERT INTO "questions" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "nnn"], ["body", "nnn"], ["created_at", "2022-11-03 18:44:04.523263"], ["updated_at", "2022-11-03 18:44:04.523263"], ["user_id", 1]]

  def update
    question.update(question_params.merge(user: current_user))
---
UPDATE "questions" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["title", "nnn3"], ["body", "3jjj"], ["updated_at", "2023-06-10 14:11:42.682774"], ["id", 5]]

  def destroy
    @question.destroy if current_user.author?(@question)
---
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 7]]

  def question
    @question ||= params[:id] ? Question.with_attached_files.find(params[:id]) : Question.new
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]