app/models/answer.rb

  def mark
    best = question.answers.where(best: true)
    unless best.first == self
      best.update(best: false)
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 AND "answers"."best" = $2 ORDER BY "answers"."id" ASC LIMIT $3  [["question_id", 1], ["best", true], ["LIMIT", 1]]
UPDATE "answers" SET "updated_at" = $1, "best" = $2 WHERE "answers"."id" = $3  [["updated_at", "2023-07-16 14:30:32.540346"], ["best", true], ["id", 1]]